app/views/installations/show.html.erb

  <ol>
    <% @installation.sites.each do |site| %>
---
SELECT "sites".* FROM "sites"  WHERE "sites"."installation_id" = $1  ORDER BY created_at DESC  [["installation_id", 1]]