app/views/devise/registrations/edit.html.erb

    <div class="col-sm-3">
      <%= f.collection_select(:location, Installation.all, :installation, :installation, :include_blank => "None") %>
---
SELECT "installations".* FROM "installations"

    <div class="col-sm-3">
      <%= f.collection_select(:lang, Language.all, :name, :name, :include_blank => "All") %>
---
SELECT "languages".* FROM "languages"