app/views/articles/_article.html.erb

            <div class="CardListTable-content">
                <% if article.language.present? %>
---
SELECT  "languages".* FROM "languages"  WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]