app/views/articles/_form.html.erb

SELECT "languages".* FROM "languages"
---
    <% if current_user.role == 'Admin' or current_user.role == 'Volunteer' %>
        <%= f.collection_select(:language_id, Language.all, :id, :name ) %>