app/views/articles/show.html.erb

        <dt>Language</dt>
        <dd><%= @article.language.present? ? @article.language.name : "N/A"  %></dd>
---
SELECT  "languages".* FROM "languages"  WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]