app/views/languages/show.html.erb

<ol>
<% @language.articles.each do |article| %><li>
---
SELECT "articles".* FROM "articles"  WHERE "articles"."language_id" = $1  ORDER BY created_at DESC  [["language_id", 1]]