app/views/users/_form.html.erb

SELECT "installations".* FROM "installations"
---
    <div class="col-sm-3">
      <%= f.collection_select(:location, Installation.all, :installation, :installation, :include_blank => "None") %>

SELECT "languages".* FROM "languages"
---
    <div class="col-sm-3">
      <%= f.collection_select(:lang, Language.all, :name, :name, :include_blank => "All") %>