app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"  WHERE (id > 0 and created_at > '1970-01-01 00:00:01.000000')  ORDER BY created_at DESC
SELECT COUNT(*) FROM "articles"  WHERE (id > 2 and created_at > '2015-03-08 16:12:53.000000')
---
  def index
    if params[:q].blank?
      @articles = Article.includes(:category, :language).page(params[:page]).per(20)

INSERT INTO "articles" ("category", "created_at", "english", "language_id", "phonetic", "picture", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category", ""], ["created_at", "2015-03-08 16:08:36.157290"], ["english", ""], ["language_id", 1], ["phonetic", ""], ["picture", "download.jpeg"], ["updated_at", "2015-03-08 16:08:36.157290"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

UPDATE "articles" SET "english" = $1, "phonetic" = $2, "updated_at" = $3 WHERE "articles"."id" = 1  [["english", "hart"], ["phonetic", "Hartt"], ["updated_at", "2015-03-08 16:09:26.145753"]]
---
  def update
    if @article.update(article_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
SELECT  "languages".* FROM "languages"  WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_article
    @article = Article.includes(:category, :language).find(params[:id])