app/controllers/installations_controller.rb

SELECT  "installations".* FROM "installations"  WHERE "installations"."id" = $1 LIMIT 1  [["id", 1]]
---
 def edit
   @installation = Installation.find(params[:id])

SELECT "installations".* FROM "installations"
---
 def index
   if current_user.has_role? :superadmin
     @installations = Installation.all.page(params[:page]).per(20)

SELECT  "installations".* FROM "installations"  WHERE "installations"."id" = $1 LIMIT 1  [["id", 1]]
---
 def show
   @installation = Installation.find(params[:id])

INSERT INTO "installations" ("address", "contact", "created_at", "email", "installation", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", "Adoo"], ["contact", "0883883"], ["created_at", "2015-03-08 16:17:59.372563"], ["email", "nuwan28@gmail.com"], ["installation", "Go"], ["updated_at", "2015-03-08 16:17:59.372563"]]
---
 def create
     @installation = Installation.new(installation_params)
     @installation.organization_id = current_user.organization.id

     if @installation.save