app/controllers/languages_controller.rb

SELECT "languages".* FROM "languages"
---
  def index
    @languages = Language.page(params[:page]).per(20)

INSERT INTO "languages" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-03-08 11:41:24.268640"], ["name", "Sinhala"], ["updated_at", "2015-03-08 11:41:24.268640"]]
---
 def create
  @language = Language.new(language_params)

  if @language.save

SELECT  "languages".* FROM "languages"  WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]
---
 def edit
  @language = Language.find(params[:id])

SELECT  "languages".* FROM "languages"  WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]
---
 def show
  @language = Language.find(params[:id])