app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites"   ORDER BY created_at DESC
---
  def index
    @sites = Site.page(params[:page]).per(20)

INSERT INTO "sites" ("created_at", "installation_id", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-03-08 16:18:18.462884"], ["installation_id", 1], ["name", "Web"], ["updated_at", "2015-03-08 16:18:18.462884"]]
---
  def create
    @site = Site.new(site_params)

    if @site.save

SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def edit
    @site = Site.find(params[:id])

SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def show
    @site = Site.find(params[:id])