app/controllers/users_controller.rb

  def index
    if params[:q].blank?
      @users = User.accessible_by(current_ability).page(params[:page]).per(20)
---
SELECT  "users".* FROM "users"  ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "users"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "contact" = $1, "email" = $2, "gender" = $3, "location" = $4, "updated_at" = $5 WHERE "users"."id" = 3  [["contact", ""], ["email", "nuwan28@gmail.com"], ["gender", ""], ["location", ""], ["updated_at", "2015-03-11 08:38:17.303919"]]

  def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY created_at DESC LIMIT 1