app/views/sites/_form.html.erb

SELECT "installations".* FROM "installations"
---
      <div class="col-sm-3">
        <%= f.collection_select(:installation_id, Installation.all, :id, :installation)  %>