app/views/sites/show.html.erb

  <ol>
    <% @site.volunteers.each do |volunteer| %>
---
SELECT "volunteers".* FROM "volunteers"  WHERE "volunteers"."site_id" = $1  [["site_id", 1]]

  <ol>
    <% @site.contributors.each do |contributor| %>
---
SELECT "contributors".* FROM "contributors"  WHERE "contributors"."site_id" = $1  [["site_id", 1]]